# Решение контролного зедания

## Решение задачи

Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

### Описание программы:
1. Ввод строки:

> Выводится: "Введите строки через пробелы: ". Далее 
вводится строка с клавиатуры с использованием Console.ReadLine().

2. Разделение строки на массив строк:

> Используется метод Split(' ') для разделения введенной строки на массив строк.

3. Инициализация массива для результата:

>Создается массив строк outputStrings для хранения отфильтрованных строк.

4. Фильтрация строк:

>Вызывается функция FilterStrings, которая принимает массив введенных строк (inputStrings) и возвращает новый массив строк, содержащий только те строки, длина которых не превышает 3 символа.

5. Вывод результата:

>Выводится результат фильтрации, т.е., строки, удовлетворяющие условиям, с использованием Console.WriteLine().


### Описание функции FilterStrings:

1. Инициализация результата:

>Создается массив строк result для хранения отфильтрованных строк.

2. Фильтрация строк:

>Проходится циклом по каждой строке в исходном массиве (original).
Если длина текущей строки не превышает 3 символа, она добавляется в массив result.

3. Уменьшение размера массива:

>Используется Array.Resize, чтобы уменьшить размер массива result до фактического размера (количества отфильтрованных строк).